---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal
source: html/c5027120-d0a1-9a1f-2f0d-9332e9c8ee73.htm
---
# VertexPositionNormal Methods

Gets the amount of storage that the vertex takes up in a buffer, measured in floats.